export class MessageCode {
  messageType: string;

// ===================================================
// ====================  КОДЫ   ОШИБОК ===============
// ===================================================

  WRONG_LOGIN = 'Ошибка аутентификации! Не верные логин и/или проль!';
  UNDER_CONSTRACTION = 'Данная функция еще не реализована! Пождите совсем чуть-чуть....';

// ===================================================
// ============  КОДЫ  СЕРВИСНЫХ СООБЩЕНИЙ ===========
// ===================================================

  AUTH_LOGOUT = 'LOGOUT';
  AUTH_LOGIN_OK = 'LOGIN';


}
