export class MessageCode {
  messageType: string;

// ===================================================
// ====================  КОДЫ   ОШИБОК ===============
// ===================================================

  WRONG_LOGIN = 'Ошибка аутентификации! Не верные логин и/или проль!';
  REGISTER_ERROR = 'Ошибка регистрации!';
  USER_DATA_CHANGE_SOME_ERROR = 'Невозможно изменить данные пользователя. Произошла техническая ошибка!';
  USER_DATA_CHANGE_SUCH_USER_EXISTS = 'Данное имя пользователя занято! Выберете другое!';
  UNDER_CONSTRACTION = 'Данная функция еще не реализована! Пождите совсем чуть-чуть....';
  SESSION_EXPIRED = 'Ваша сессия истекла!';


// ===================================================
// ============  КОДЫ  СЕРВИСНЫХ СООБЩЕНИЙ ===========
// ===================================================

  AUTH_LOGOUT = 'LOGOUT';
  AUTH_LOGIN_OK = 'LOGIN';
  USER_DATA_CHANGE_OK = 'Пользовательские данные успешно изменены!';
  REGISTER_OK = 'Пользователь успешно зарегистрирован!';

}
